Subject: One instance of subject with the following physical appearance: Subject is a human wielding a oversized bone club in a battle ready stance with weapon held in both hands pose seen from a default_perspective_angle view in a isolated overgrow stone ruins setting during dawn.

Subject must also have following traits
Anatomy: stocky and muscular with a hunched posture. He has long arms and short legs. Large jaw and mouth.
Skin: light
Facial Features:
1. Eyes: wide open
2. Mouth: closed with a blank expression
3. Teeth: regular human teeth 4 times larger than normal
Outfit Instructions:
1. Attire: subject is wearing armor and leather armor
2. headgear: leather hood
3. Accessories: feather earrings, teeth necklace with small skulls, feather ring, scale arm bands
4. Boots: primitive animal hide

ART STYLE INSTRUCTIONS:
Render the character in the image in the bold, glossy, high-saturation,
90s video game art style but with no colored lighting or overuse of loud or obscure colors.. Preserve the character’s original pose, exact outfit colors, anatomy, proportions, facial expression, wings, weapons, and overall design. The style should feature exaggerated anatomy, bold outlines, dramatic but colorless lighting, and airbrushed shading reminiscent of retro side-scrolling beat-em-up boss artwork. Use no noise or grain surface textures. Just lines and shading. Use a limited color palette — not overly bright or cartoonish. Use realistic colors with some extra saturation. Avoid toy-like or gaudy colors. The character design should feel intimidating, powerful, and sophisticated. Lighting should be consistent, natural, and neutral, not stylized with colored glows or colored rim lighting. Do not use red, blue, or any colored rim lighting or ambient glows. All lighting must be neutral and realistic. No stylized edge lights or neon highlights. Ignore any genre conventions that conflict with this lighting instruction. There must be no colored lighting that produces highlights on the subject or shines on it in any way. All lighting must be neutral and does not change or add colors to the subject's appearance.

Use https://github.com/cameronstiffler/goon-squad-galaxy-card-renderer/art/art_style_examples/character_art_style_with_many_examples.png and
https://github.com/cameronstiffler/goon-squad-galaxy-card-renderer/art/art_style_examples/krax.jpg as art style references